from simple_blogger.poster.telegram import TelegramPoster
from simple_blogger.poster.instagram import InstagramPoster
from simple_blogger.poster.vk import VkPoster
from simple_blogger.blogger import Journalist
from simple_blogger.preprocessor.text import TagAdder
from simple_blogger.generator.openai import OpenAiTextGenerator
# from simple_blogger.generator.openai import OpenAiImageGenerator
from simple_blogger.generator.yandex import YandexImageGenerator
import datetime

class CinemanBlogger(Journalist):
    # def _system_prompt(self):
    #     return 'Ты - киноман'

    def _message_generator(self):
        return OpenAiTextGenerator('Ты - киноман')
    
    def _image_generator(self):
        return YandexImageGenerator(style_prompt='Стиль мультяшный, анимация в стиле Хидэтака Миядзаки')

    # def _image_generator(self):
    #     return OpenAiImageGenerator(system_prompt="Нарисуй рисунок, вдохновлённый описанием")

    def _prompt_constructor(self, _):
        return f"Опиши рандомный фильм из категории '{self.category}', расскажи интересный факт о фильме. Не упоминай авторов. Используй смайлики и не более 150 слов."

    def __init__(self, category, tags):
        self.category = category
        tagadder = TagAdder(['#киноман', '#кино', '#иллюстрации', *tags ])
        posters = [
            TelegramPoster(chat_id='@cineman_the', processor=tagadder),
            VkPoster(group_id='230191211', processor=tagadder),
            # InstagramPoster(account_token_name='CINEMAN_THE_TOKEN', account_id='9573627319341163', processor=tagadder)
            # TelegramPoster(processor=tagadder)
        ]
        super().__init__(posters)

def post(offset=0):
    start_date = datetime.date(2025, 4, 20)
    today = datetime.date.today()
    category = [
        ("Американская комедия 80-х", ['#комедия']),
        # ("Российская комедия 90-х", ['#комедия']),
        ("Европейские ужасы 2010-х", ['#ужасы']),
        # ("Российские приключения 2000-х", ['#приключения']),
        ("Европейские триллеры 2010-х", ['#триллер']),
        ("Европейские приключения 80-х", ['#приключения']),
        ("Европейские ужасы 80-х", ['#ужасы']),
        ("Европейская драма 90-х", ['#драма']),
        ("Европейские приключения 90-х", ['#приключения']),
        ("Американская комедия 2010-х", ['#комедия']),
        ("Американская драма 80-х", ['#драма']),
        ("Американские триллеры 80-х", ['#триллер']),
        ("Европейская комедия 2010-х", ['#комедия']),
        # ("Российская драма 90-х", ['#драма']),
        ("Европейская драма 80-х", ['#драма']),
        ("Американские ужасы 80-х", ['#ужасы']),
        ("Европейские триллеры 2000-х", ['#триллер']),
        # ("Советская драма 80-х", ['#драма']),
        ("Американские приключения 80-х", ['#приключения']),
        ("Европейские ужасы 2000-х", ['#ужасы']),
        # ("Российские приключения 90-х", ['#приключения']),
        ("Европейская комедия 90-х", ['#комедия']),
        ("Американские триллеры 2000-х", ['#триллер']),
        # ("Российская комедия 2000-х", ['#комедия']),
        ("Европейские приключения 2010-х", ['#приключения']),
        ("Американская комедия 90-х", ['#комедия']),
        ("Американские триллеры 2010-х", ['#триллер']),
        ("Европейские триллеры 90-х", ['#триллер']),
        ("Американская драма 2010-х", ['#драма']),
        # ("Российская драма 2000-х", ['#драма']),
        ("Американские ужасы 90-х", ['#ужасы']),
        ("Европейские триллеры 80-х", ['#триллер']),
        ("Европейская драма 2000-х", ['#драма']),
        ("Американская драма 2000-х", ['#драма']),
        ("Американские ужасы 2010-х", ['#ужасы']),
        # ("Советские приключения 80-х", ['#приключения']),
        ("Американские приключения 2000-х", ['#приключения']),
        ("Американская комедия 2000-х", ['#комедия']),
        ("Американские приключения 90-х", ['#приключения']),
        # ("Российские приключения 2010-х", ['#приключения']),       
        ("Американские ужасы 2000-х", ['#ужасы']),
        ("Европейские приключения 2000-х", ['#приключения']),
        ("Американская драма 90-х", ['#драма']),
        ("Европейские ужасы 90-х", ['#ужасы']),
        # ("Советская комедия 80-х", ['#комедия']),
        ("Европейская драма 2010-х", ['#драма']),
        # ("Российская комедия 2010-х", ['#комедия']),
        ("Европейская комедия 80-х", ['#комедия']),
        # ("Российская драма 2010-х", ['#драма']),
        ("Европейская комедия 2000-х", ['#комедия']),
        ("Американские триллеры 90-х", ['#триллер']),
        ("Американские приключения 2010-х", ['#приключения']),
    ]
    index = ((today - start_date).days + offset) % len(category)
    blogger = CinemanBlogger(category[index][0], category[index][1])
    blogger.post()

if __name__ == "__main__":
    post()