from simple_blogger.poster.telegram import TelegramPoster
from simple_blogger.poster.instagram import InstagramPoster
from simple_blogger.poster.vk import VkPoster
from simple_blogger.blogger import Journalist
from simple_blogger.preprocessor.text import TagAdder
from simple_blogger.generator.openai import OpenAiTextGenerator
# from simple_blogger.generator.openai import OpenAiImageGenerator
from simple_blogger.generator.yandex import YandexImageGenerator
import datetime

class ScriptorBlogger(Journalist):
    # def _system_prompt(self):
    #     return 'Ты - игроман'

    def _message_generator(self):
        return OpenAiTextGenerator('Ты - книгоман')
    
    def _image_generator(self):
        return YandexImageGenerator(style_prompt='Киберпанк, гиперреалистичный')

    # def _image_generator(self):
    #     return OpenAiImageGenerator(system_prompt="Нарисуй рисунок, вдохновлённый описанием")

    def _prompt_constructor(self, _):
        return f"Опиши рандомную существующую книгу из категории '{self.category}', расскажи интересный факт о книге. Не упоминай авторов. Используй смайлики и не более 150 слов."

    def __init__(self, category, tags):
        self.category = category
        tagadder = TagAdder(['#книгоман', '#книги', '#иллюстрации', *tags ])
        posters = [
            TelegramPoster(chat_id='@scriptor_the', processor=tagadder),
            VkPoster(group_id='230463742', processor=tagadder),
            # TelegramPoster(processor=tagadder)
        ]
        super().__init__(posters)

def post(offset=0):
    start_date = datetime.date(2025, 5, 12)
    today = datetime.date.today()
    category = [
        ("Супергеройские комиксы 2010-x", ['#комикс']),
        ("Мифологические ретеллинги 2010-x", ['#ретеллинг']),
        ("Научпоп 2010-x", ['#научпоп']),
        ("Постапокалипсис 1990-x", ['#постапокалипсис']),
        ("Минималистичный хоррор 2020-x", ['#хоррор']),
        ("Феминистская проза 1990-x", ['#проза']),
        ("Тёмное фэнтези 1980-x", ['#фэнтези']),
        ("Графические романы 2000-x", ['#роман']),
        ("Ужасы 1980-x", ['#ужасы']),
        ("Детская литература 1980-x", ['#детская']),
        ("Конспирологические детективы 2000-x", ['#детектив']),
        ("Инстапоэзия 2010-x", ['#поэзия']),
        ("Киберпанк 1980-x", ['#киберпанк']),
        ("Нон-фикшн (саморазвитие) 2000-x", ['#нонфикшн']),
        ("Мистика 2000-x", ['#мистика']),
        ("Крутые детективы 1980-x", ['#детектив']),
        ("Психологические триллеры с ненадёжным рассказчиком 2010-x", ['#триллеры']),
        ("Поколенческая проза 2010-x", ['#проза']),
        ("Киберпанк 2000-x", ['#киберпанк']),
        ("Научная фантастика (космос) 1980-x", ['#фантастика']),
        ("Боевики/Экшн 1980-x", ['#боевик']),
        ("Психологические детективы 1990-x", ['#детектив']),
        ("Корпоративные дистопии 2020-x", ['#дистопия']),
        ("Подростковые ужасы 1990-x", ['#ужасы']),
        ("Современное фэнтези 2010-x", ['#фэнтези']),
        ("Нон-фикшн (мемуары) 1990-x", ['#нонфикшн']),
        ("Вампирская романтика 2000-x", ['#романтика']),
        ("Городское фэнтези 2000-x", ['#фэнтези']),
        ("Метавселенные 2020-x", ['#метавселенная']),
        ("Романтические драмы 2000-x", ['#драма']),
        ("Технотриллеры 1990-x", ['#триллеры']),
        ("Психологические триллеры 2000-x", ['#триллеры']),
        ("Климатическая фантастика 2000-x", ['#фантастика']),
        ("Городское фэнтези 1990-x", ['#фэнтези']),
        ("Магический реализм 1990-x", ['#реализм']),
        ("Young Adult антиутопии 2000-x", ['#антиутопия']),
        ("Феминистская проза 2010-x", ['#проза']),
        ("Альтернативная история 2010-x", ['#история']),
        ("Психологические триллеры 1980-x", ['#триллеры']),
        ("Кли-фай (климатическая фантастика) 2020-x", ['#фантастика']),
        ("Эко-триллеры 2020-x", ['#триллеры']),
        ("ЛитРПГ 2000-x", ['#рпг']),
        ("Климатическая фантастика 2010-x", ['#фантастика']),
        ("Мемуарная проза 2010-x", ['#проза']),
        ("Нуарные антиутопии 2010-x", ['#антиутопия']),
        ("NFT-литература 2020-x", ['#nft']),
        ("Цифровой реализм 2020-x", ['#реализм']),
        ("Постмодернистская проза 1990-x", ['#проза']),
        ("Нон-фикшн (бизнес/психология) 1980-x", ['#нонфикшн']),
        ("Альтернативная история 1990-x", ['#история']),
        ("Ревизионистские биографии 2020-x", ['#биография']),
        ("Романтические саги 1980-x", ['#сага']),
        ("Пандемийная литература 2020-x", ['#пандемия']),
        ("Постапокалипсис 1980-x", ['#постапокалипсис']),
        ("Эпическое фэнтези 1990-x", ['#фэнтези']),
        ("Нейродивергентные нарративы 2020-x", ['#нарратив']),
        ("Юридические триллеры 1990-x", ['#триллеры']),
        ("Тикток-литература 2020-x", ['#тикток']),
        ("Эпическое фэнтези 1980-x", ['#фэнтези']),
    ]
    index = ((today - start_date).days + offset) % len(category)
    blogger = ScriptorBlogger(category[index][0], category[index][1])
    blogger.post()

if __name__ == "__main__":
    post()